Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: This scope is too large to check. Choose a smaller category, a component, or a translation.
sv: Det här omfånget är för stort att kontrollera. Välj en mindre kategori, en komponent eller en översättning.

source: Watched
sv: Bevakade

source: Administered
sv: Administrerade

source: Source-string comments ignore notification languages; other comments require a matching language.
sv: Kommentarer om källsträngar ignorerar aviseringsspråk; andra kommentarer kräver ett matchande språk.

source: The comment must mention this user.
sv: Kommentaren måste nämna den här användaren.

source: The user must have contributed to the string or previously participated in its discussion.
sv: Användaren måste ha bidragit till strängen eller tidigare deltagit i diskussionen om den.

source: The announcement must enable notifications. If it specifies a language, that language must match the user’s notification languages.
sv: Meddelandet måste aktivera aviseringar. Om det anger ett språk måste språket matcha användarens aviseringsspråk.

source: The alert must be at least a warning and the user must be able to act on it. Linked-component and project-wide alerts can be deduplicated.
sv: Varningen måste vara minst en varning och användaren måste kunna agera på den. Varningar för länkade komponenter och hela projekt kan avdupliceras.

source: The invitation link is no longer valid.
sv: Inbjudningsslänken är inte längre giltig.

source: This invitation has expired.
sv: Denna inbjudan har gått ut.

source: Use a passkey or security key (WebAuthn)
sv: Använd en inloggningsnyckel eller säkerhetsnyckel (WebAuthn)

source: Invalid trial plan.
sv: Ogiltig provplan.

source: Notification diagnostics for %(user)s
sv: Aviseringsdiagnostik för %(user)s

source: This user can not be edited.
sv: Denna användare kan inte redigeras.

source: Reverting edits by %(user)s site-wide was scheduled.
sv: Att återkallar redigeringar av %(user)s över hela sajten har schemalagts.

source: Cleaning up contributions by %(user)s site-wide was scheduled.
sv: Att rensa upp bidrag från %(user)s över hela sajten har schemalagts.

source: No cleanup action was selected.
sv: Ingen uppstädningsåtgärd valdes.

source: Code site
sv: Kodwebbsida

source: This profile link is no longer available.
sv: Denna profil är inte längre tillgänglig.

source: External profile link
sv: Extern profillänk

source: Please confirm your identity using a second factor before proceeding.
sv: Begränsa din identitet med en andra faktor innan du går vidare.

source: Try resetting your password again to verify your identity, the confirmation link probably expired.
sv: Försök att återställa ditt lösenord igen för att verifiera din identitet, bekräftelselänken har förmodligen gått ut.

source: This authentication app registration is no longer valid. Start a new registration.
sv: Den här registreringen av autentiseringsappen är inte längre giltig. Starta en ny registrering.

source: Too many failed authentication attempts. Please reset your password to regain access to your account.
sv: För många misslyckade autentiseringsförsök. Återställ lösenordet för att få åtkomst till ditt konto igen.

source: Translation files CDN
sv: Översättningsfiler-CDN

source: Publishes translation files into a content delivery network.
sv: Publicerar översättningsfiler till ett innehållsleveransnätverk (content delivery network).

source: The translation files CDN add-on cannot publish weblate.js.
sv: Tillägget för översättningsfiler-CDN kan inte publicera weblate.js.

source: This add-on affects the whole project and may create translation files across many components or repositories.
sv: Detta tillägg påverkar hela projektet och kan skapa översättningsfiler i många komponenter eller förråd.

source: This add-on affects the whole category and may create translation files across many components or repositories.
sv: Detta tillägg påverkar hela kategorin och kan skapa översättningsfiler i många komponenter eller förråd.

source: This add-on affects all projects and may create translation files across many components or repositories.
sv: Detta tillägg påverkar alla projekt och kan skapa översättningsfiler i många komponenter eller förråd.

source: The language filter timed out.
sv: Språkfiltret har överskridit tidsgränsen.

source: Skipped
sv: Hoppades över

source: The add-on is not compatible with this component.
sv: Tillögget är inte kompatibelt med denna komponent.

source: There are no compatible components to process.
sv: Det finns inga kompatibla komponenter att bearbeta.

source: The add-on is not scheduled to run yet.
sv: Tillägget är ännu inte schemalagt att köras.

source: There are no relevant changes to process.
sv: Det finns inga relevanta ändringar att bearbeta.

source: Background processing is disabled.
sv: Bakgrundsbearbetning är avaktiverat.

source: The component is not scheduled for background processing today.
sv: Komponenten är inte schemalagd för bakgrundsbearbetning idag.

source: There are no eligible strings to process.
sv: Det finns inga strängar som uppfyller kriterierna för bearbetning.

source: The target no longer exists.
sv: Målet finns inte längre.

source: A required file is not available.
sv: En nödvändig fil finns inte tillgänglig.

source: There are no outgoing commits to process.
sv: Det finns inga utgående fastställanden att utföra.

source: The add-on does not apply to this event.
sv: Tillägget gäller inte för denna händelse.

source: No source files are configured.
sv: Inga källfiler är konfigurerade.

source: The configured output path is invalid.
sv: Den konfigurerade utdatasökvägen är felaktig.

source: The add-on execution failed.
sv: Körningen av tillägget misslyckades.

source: Message ID: %(message_id)s
sv: Meddelande-ID: %(message_id)s

source: Fedora Messaging publish timed out; the broker connection or delivery confirmation did not complete: %(error)s
sv: Tidsgränsen för publicering på Fedora Messaging gick ut; anslutningen eller leveransbekräftelsen till mellanhanden fullbordades inte: %(error)s

source: Fedora Messaging publisher service was unavailable; the connection will be recreated on the next attempt: %(error)s
sv: Publiceringstjänsten Fedora Messaging var inte tillgänglig; anslutningen kommer att återupprättas vid nästa försök: %(error)s

source: Fedora Messaging broker returned the message: %(error)s
sv: Mellanhanden Fedora Messaging returnerade meddelandet: %(error)s

source: Fedora Messaging broker rejected the message: %(error)s
sv: Mellanhanden Fedora Messaging avvisade meddelandet: %(error)s

source: Fedora Messaging publish failed: %(error)s
sv: Publiceringen på Fedora Messaging misslyckades: %(error)s

source: configured
sv: konfigurerad

source: Could not reset Fedora Messaging publisher service.
sv: Det gick inte att återställa publiceringstjänsten Fedora Messaging.

source: CA certificates must be valid PEM encoded X.509 certificates.
sv: CA-certifikat måste vara giltiga PEM-kodade X.509-certifikat.

source: Client SSL key must be an unencrypted PEM encoded private key.
sv: Klientens SSL-nyckel måste vara en okrypterad PEM-kodad privat nyckel.

source: Client SSL certificates must be valid PEM encoded X.509 certificates.
sv: Klientens SSL-certifikat måste vara giltiga PEM-kodade X.509-certifikat.

source: Fedora Messaging broker URL is invalid: %(error)s
sv: URL:en till Fedora Messagings mellanhand är ogiltig: %(error)s

source: Could not verify TLS connection to the Fedora Messaging broker: %(error)s
sv: Kunde inte verifiera TLS-anslutningen till Fedora Messagings mellanhand: %(error)s

source: Update frequency
sv: Uppdateringsfrekvens

source: Weekly
sv: Veckovis

source: How often the add-on should update the POT file when the component is refreshed.
sv: Hur ofta tillägget skall uppdatera POT-filen när komponenten uppdateras.

source: Normalize POT header
sv: Normalisera POT-huvudet

source: Updates gettext headers and replaces placeholder POT comments.
sv: Uppdaterar gettext-huvuden och ersätter platshållare i POT-kommentarer.

source: Update PO files using msgmerge
sv: Uppdatera PO-filer med msgmerge

source: Ensures the msgmerge add-on is installed and triggers it after the POT file is updated.
sv: Säkerställer att tillägget msgmerg är installerat och triggar det efter att POT-filen är uppdaterad.

source: Source locations
sv: Källplatser

source: Use file format settings
sv: Använd filformatinställningar

source: Extract locations to the POT file
sv: Extrahera platser till POT-filen

source: Do not extract locations
sv: Extrahera inte platser

source: Choose how extraction writes source locations to the POT file. Use this to keep locations in the template while omitting them from translated PO files.
sv: Välj hur extraktionen skriver källplatser till POT-filen. Använd detta för att behålla platserna i mallen medan de utelämnas från översatta PO-filer.

source: Keyword entries have to be strings.
sv: Nyckelordsposter måste vara strängar.

source: ITS data directories
sv: ITS-datakataloger

source: Newline-separated repository-relative directories containing an its subdirectory, for example po for po/its. Earlier directories override later directories and bundled rules.
sv: Kataloger som anges relativt arkivets rot och innehåller en underkatalog med namnet its, till exempel po för po/its. Ange en katalog per rad. Tidigare kataloger har företräde framför senare kataloger och medföljande regler.

source: Do not extract comments
sv: Extrahera inte kommentarer

source: Extract all comments
sv: Extrahera alla kommentarer

source: Extract comments with tag
sv: Extrahera kommentarer med tagg

source: Code comments
sv: Kodkommentarer

source: Choose whether xgettext should extract no comments, all comments, or only comments marked with a specific tag.
sv: Välj om xgettext inte skall extrahera några kommentarer, extrahera alla kommentarer eller endast extrahera kommentarer som är märkta med en viss tagg.

source: Comment tag
sv: Kommentartagg

source: Tag passed to xgettext for comment extraction when using tagged comment mode.
sv: Tagg som skickas till xgettext för extrahering av kommentarer när läget för taggade kommentarer används.

source: xgettext checks
sv: xgettext-kontroller

source: Additional xgettext validation checks to enable for extracted messages.
sv: Ytterligare valideringskontroller med xgettext som skall aktiveras för extraherade meddelanden.

source: Additional keywords
sv: Ytterligare nyckelord

source: Newline-separated extra keywords passed to xgettext using --keyword.
sv: Extra nyckelord, åtskilda med radbrytningar, som skickas till xgettext med hjälp av --keyword.

source: Use keywords exclusively
sv: Använd endast nyckelord

source: When enabled, passes --keyword without a value to xgettext before the additional keyword, disabling all default keywords so that only the keyword specified above is recognized.
sv: När denna funktion är aktiverad skickas --keyword utan något värde till xgettext före det ytterligare nyckelordet, vilket deaktiverar alla standardnyckelord så att endast det ovan angivna nyckelordet känns igen.

source: An additional keyword is required when using keywords exclusively.
sv: Ett ytterligare nyckelord krävs när man uteslutande använder nyckelord.

source: Input source
sv: Indatakälla

source: Source file patterns
sv: Mönster för källfiler

source: POTFILES manifest
sv: POTFILES-förteckningen

source: Choose whether xgettext should read source files from glob patterns or from a POTFILES/POTFILES.in manifest.
sv: Välj huruvida xgettext skall läsa källfiler från glob-mönster eller från en förteckning POTFILES/POTFILES.in.

source: xgettext language
sv: xgettext-språk

source: Programming language passed to xgettext, for example Python or C. Leave blank to let xgettext guess the language from file extensions.
sv: Programmeringsspråk som skickas till xgettext, till exempel Python eller C. Lämna det blankt för att låta xgettext gissa språket utgående från filändelsen.

source: Newline-separated repository-relative glob patterns for files to extract with xgettext.
sv: Nyradsseparerade förrådsrelativa glob-mönster på filer som skall extraheras med xgettext.

source: POTFILES path
sv: POTFILES-sökväg

source: Repository-relative path to POTFILES or POTFILES.in. Entries are resolved relative to the repository root. If present next to the manifest, POTFILES.skip excludes listed files from extraction.
sv: Relativ sökväg i förrådet till POTFILES eller POTFILES.in. Posterna tolkas relativt förrådets rotkatalog. Om POTFILES.skip finns angivet bredvid manifestet utesluts de filer som anges där från extraheringen.

source: POTFILES path has to point to a file.
sv: POTFILES-sökvägen måste peka på en fil.

source: Meson preset
sv: Meson-förinställning

source: Built-in xgettext argument preset matching Meson gettext integration. The GLib preset adds the keyword and format-flag options used by Meson's gettext helper.
sv: Inbyggd förinställning för xgettext-argument som överensstämmer med Mesons gettext-integration. GLib-förinställningen lägger till de nyckelords- och formatflaggaalternativ som används av Mesons gettext-hjälpfunktion.

source: The Meson add-on expects a Meson gettext directory with meson.build and POTFILES or POTFILES.in.
sv: Tillägget Meson förväntar sig en Meson gettext-katalog med meson.build och POTFILES eller POTFILES.in.

source: The component has to define a gettext template for new translations.
sv: Komponenten måste definiera en gettext-mall för nya översättningar.

source: The Django add-on expects the template for new translations to be named "django.pot", "djangojs.pot", "django.po", or "djangojs.po".
sv: Django-tillägget förväntar sig att mallen för nya översättningar ska ha namnet ”django.pot”, ”djangojs.pot”, ”django.po” eller ”djangojs.po”.

source: Filtering
sv: Filtrering

source: Weblate documentation
sv: Weblate-dokumentation

source: Optionally remove strings that are not useful to translate after Sphinx extraction.
sv: Ta om så önskas bort strängar som inte är meningsfulla översätta efter Sphinx-extrahering.

source: The Sphinx add-on expects the template for new translations to be a .pot file.
sv: Sphinx-tillägget förväntar sig att mallen för nya översättningar ska vara en .pot-fil.

source: The Sphinx add-on expects the template for new translations to live in a "locales" directory.
sv: Sphinx-tillägget förväntar sig att mallen för nya översättningar ska finnas i en katalog "locales".

source: Could not determine Sphinx source directory.
sv: Kunde inte bestämma Sphinx källkatalog.

source: Output scope
sv: Omfattning för utdata

source: One file per translation
sv: En fil per översättning

source: One file per component
sv: En fil per komponent

source: Trailer lines are lines that look similar to RFC 822 e-mail headers, at the end of the otherwise free-form part of a commit message, such as 'Co-authored-by: …'.
sv: Trailer-rader är rader som liknar RFC 822 e-posthuvuden i slutet på den i övrigt fria delen av ett arkiveringsmeddelande, t.ex. 'Co-authored-by: ...'.

source: Threshold for removal. Leave empty to remove suggestions regardless of votes. This field has no effect with voting turned off.
sv: Tröskelvärde för borttagning. Lämna fältet tomt för att ta bort förslag oavsett antalet röster. Fältet har ingen effekt om omröstning är avstängt.

source: I confirm the above actions look correct
sv: Jag bekräftar att ovanstående åtgärder ser korrekta ut

source: Please review and confirm the missing language changes.
sv: Vänligen granska och bekräfta de saknade språkändringarna.

source: The regular expression must define a named group for component. Also define a named group for language when matching translation files. When the file mask is set, omit language and match the monolingual base or new base file instead.
sv: Det reguljära uttrycket måste definiera en namngiven grupp för komponent. Definiera också en namngiven grupp för språk när översättningsfiler matchas. När filmasken är angiven ska språk utelämnas och den enspråkiga basfilen eller nya basfilen matchas i stället.

source: Use Django template syntax. This template must include {{ component }}.
sv: Använd Djangos mallsyntax. Mallen måste innehålla {{ component }}.

source: Leave empty for bilingual translation files. When set, this template must include {{ component }}.
sv: Lämna tom för tvåspråkiga översättningsfiler. När det är inställt måste denna mall inkludera {{ component }}.

source: Filename of file used for creating new translations. For gettext choose .pot file. This template must include {{ component }}.
sv: Filnamn för filen som används för att skapa nya översättningar. För gettext välj .pot-fil. Denna mall måste innehålla {{ component }}.

source: Filename of intermediate translation file. In most cases this is a translation file provided by developers and is used when creating actual source strings. This template must include {{ component }}.
sv: Filnamn på den mellanliggande översättningsfilen. I de flesta fall är detta en översättningsfil som tillhandahålls av utvecklarna och som används vid skapandet av de faktiska källsträngarna. Denna mall måste innehålla {{ component }}.

source: Define the file mask
sv: Ange filmasken

source: Leave empty to match translation files directly. When set, discovery matches the monolingual base or new base file and uses this template as the file mask. Include a language wildcard and {{ component }}, for example locale/*/{{ component }}.po or docs/{{ component }}_*.md.
sv: Lämna tomt för att matcha översättningsfiler direkt. När värdet anges matchar upptäckt den enspråkiga basfilen eller nya basfilen och använder den här mallen som filmask. Inkludera ett jokertecken för språk och {{ component }}, till exempel locale/*/{{ component }}.po eller docs/{{ component }}_*.md.

source: Generic preset: %(name)s [%(details)s]
sv: Allmän förinställning: %(name)s [%(details)s]

source: format not preset
sv: formatet är inte förinställt

source: monolingual base: %(base)s
sv: enspråkig bas: %(base)s

source: no monolingual base
sv: ingen enspråkig bas

source: Matches files like cs/application.po.
sv: Matchar filer som sv/program.po.

source: Matches files like locale/cs/LC_MESSAGES/application.po.
sv: Matchar filer som locale/sv/LC_MESSAGES/program.po.

source: Matches files like src/locale/application.cs.po.
sv: Matchar filer som src/locale/program.sv.po.

source: Filename-based language variants
sv: Filenambaserade språkvarianter

source: Matches files like news_en.md.
sv: Matchar filer som nyheter_sv.md.

source: Matches files like locale/cs/application/cs.po.
sv: Matchar filer som locale/sv/program/sv.po.

source: Matches files like res/values-cs/strings-about.xml.
sv: Matchar filer som res/values-sv/strings-about.xml.

source: Matches nested Java properties layouts and also fills the component name template.
sv: Matchar nästade Java-egenskapsstrukturer och fyller även i mallen för komponentnamn.

source: Detected: %(pattern)s [%(details)s]
sv: Upptäckt: %(pattern)s [%(details)s]

source: Detected from repository
sv: Upptäckt från förråd

source: Generic presets
sv: Allmänna förinställningar

source: Define the base file for new translations when creating components from a template.
sv: Ange basfilen för nya översättningar när komponenter skapas från en mall.

source: Define a monolingual base or new base filename when creating components from a template.
sv: Ange ett enspråkigt basfilnamn eller nytt basfilnamn när komponenter skapas från en mall.

source: The file mask must include a language wildcard (*).
sv: Filmasken måste innehålla ett jokertecken för språk (*).

source: Omit the language named group when creating components from a monolingual base or new base file.
sv: Utelämna den namngivna gruppen för språk när komponenter skapas från en enspråkig basfil eller ny basfil.

source: This template must include {{ component }}.
sv: Denna mall måste innehålla {{ component }}.

source: This template must include component markup.
sv: Denna mall måste innehålla markering för komponenter.

source: Change events to trigger
sv: Ändringshändelser som skall utösas

source: Translation content events
sv: Översättningsinnehållshändelser

source: All change events
sv: Alla ändringshändelser

source: Selected change events
sv: Utvalda ändringshändelser

source: Choose which change events should trigger this add-on.
sv: Välj vilka ändringshändelser som ska aktivera detta tillägg.

source: AMQP broker URL
sv: AMQP-mellanhands-URL

source: The AMQP broker URL to connect to.
sv: AMQP-mellanhandens URL att ansluta till.

source: Topic prefix
sv: Ämnesprefix

source: Optional prefix to prepend to generated message topics.
sv: Ett valfritt prefix som skall läggas till i början av genererade meddelandes ämne.

source: CA certificate bundle (PEM)
sv: CA-certifikatspaket (PEM)

source: Paste only PEM certificate blocks, each starting with "-----BEGIN CERTIFICATE-----" and ending with "-----END CERTIFICATE-----".
sv: Klistra in endast PEM-certifikatblock, som alla börjar med ”-----BEGIN CERTIFICATE-----” och slutar med ”-----END CERTIFICATE-----”.

source: Client private key (PEM)
sv: Klientens privata nyckel (PEM)

source: Paste a single unencrypted PEM private key block. Encrypted private keys are not supported.
sv: Klistra in ett ensamt okrypterat PEM-block med en privat nyckel. Krypterade privata nycklar stödjs inte.

source: Client certificate (PEM)
sv: Klientcertifikat (PEM)

source: Paste only the PEM certificate block starting with "-----BEGIN CERTIFICATE-----"; do not paste the output from "openssl x509 -text".
sv: Klistra in endast PEM-certifikatblocket som börjar med ”-----BEGIN CERTIFICATE-----”; klistra inte in utdata från ”openssl x509 -text”.

source: Publish timeout
sv: Tidsgräns för publicering

source: How many seconds to wait for the broker delivery acknowledgement.
sv: Hur många sekunder man skall vänta på bekräftelse från mellanhanden.

source: Connection attempts
sv: Anslutningsförsök

source: How many times to try connecting to the broker.
sv: Hur många gånger man skall försöka ansluta till mellanhanden.

source: Retry delay
sv: Fördröjning innan nytt försök

source: How many seconds to wait between connection attempts.
sv: Hur många sekunder man skall vänta mellan anslutningsförsöken.

source: Topic prefix can contain only ASCII characters.
sv: Ämnesprefixet får endast innehålla ASCII-tecken.

source: Topic prefix must not exceed %(limit)d characters.
sv: Ämnesprefixet får inte överstiga %(limit)d tecken.

source: Updates the LINGUAS file when a translation is added or removed.
sv: Uppdaterar filen LINGUAS när en översättning läggs till eller tas bort.

source: Updates the ALL_LINGUAS variable in "configure", "configure.in" or "configure.ac" files, when a translation is added or removed.
sv: Uppdaterar variabeln ALL_LINGUAS i filerna ”configure”, ”configure.in” eller ”configure.ac” när en översättning läggs till eller tas bort.

source: Update POT file (xgettext)
sv: Uppdatera POT-filen (xgettext)

source: Updates the gettext template using xgettext on selected source files.
sv: Uppdatera gettext-mallen genom att använda xgettext på utvalda källfiler.

source: Update POT file (Meson)
sv: Uppdatera POT-filen (Meson)

source: Updates the gettext template using Meson gettext conventions.
sv: Uppdaterar gettext-mallen enligt Mesons gettext-konventioner.

source: Update gettext template (Django)
sv: Uppdatera gettext-mallen (Django)

source: Updates the gettext template using Django's built-in makemessages command.
sv: Uppdaterar gettext-mallen med Djangos inbyggda kommando makemessages.

source: Update POT file (Sphinx)
sv: Uppdatera POT-fil (Sphinx)
